; domain
(define
  (domain BLOCKS)
  (:requirements :strips :typing :equality)
  (:types block)
  (:constants S T A R H C U K - block)
  (:predicates (on ?x ?y - block) (ontable ?x - block) (clear ?x - block) (handempty) (holding ?x - block) (obs_0) (obs_1))
  (:action pick-up :parameters (?x - block) :precondition (and (clear ?x) (ontable ?x) (handempty)) :effect (and (not (ontable ?x)) (not (clear ?x)) (not (handempty)) (holding ?x)))
  (:action put-down :parameters (?x - block) :precondition (holding ?x) :effect (and (not (holding ?x)) (clear ?x) (handempty) (ontable ?x)))
  (:action stack :parameters (?x ?y - block) :precondition (and (holding ?x) (clear ?y) (not (= ?x ?y))) :effect (and (not (holding ?x)) (not (clear ?y)) (clear ?x) (handempty) (on ?x ?y)))
  (:action unstack :parameters (?x ?y - block) :precondition (and (on ?x ?y) (clear ?x) (handempty) (not (= ?x ?y))) :effect (and (holding ?x) (clear ?y) (not (clear ?x)) (not (handempty)) (not (on ?x ?y))))
  (:action unstack__obs1 :parameters () :precondition (and (on s a) (clear s) (handempty) (not (= s a)) (obs_0)) :effect (and (holding s) (clear a) (not (clear s)) (not (handempty)) (not (on s a)) (obs_1)))
)

; problem
(define (problem blocks_words)
(:domain blocks)
(:objects

S T A R H C U K - block
)
(:init
(HANDEMPTY)
(CLEAR T)
(ONTABLE T)
(CLEAR U)
(ONTABLE U)
(CLEAR R)
(ONTABLE R)
(CLEAR K)
(ONTABLE K)
(CLEAR C)
(ONTABLE C)
(CLEAR S)
(ON S A)
(ON A H)
(ONTABLE H)
)
(:goal (and
(CLEAR C)
(ONTABLE H)
(ON C R)
(ON R U)
(ON U S)
(ON S H)
))
)

; plan
1. (unstack s a)
   deleted: (clear s) (handempty) (on s a)
   added: (holding s) (clear a)
   goals met: 2 of 6
2. (stack s k)
   deleted: (holding s) (clear k)
   added: (clear s) (handempty) (on s k)
   goals met: 2 of 6
3. (unstack a h)
   deleted: (clear a) (handempty) (on a h)
   added: (holding a) (clear h)
   goals met: 2 of 6
4. (put-down a)
   deleted: (holding a)
   added: (clear a) (handempty) (ontable a)
   goals met: 2 of 6
5. (unstack s k)
   deleted: (clear s) (handempty) (on s k)
   added: (holding s) (clear k)
   goals met: 2 of 6
6. (stack s h)
   deleted: (holding s) (clear h)
   added: (clear s) (handempty) (on s h)
   goals met: 3 of 6
7. (pick-up u)
   deleted: (ontable u) (clear u) (handempty)
   added: (holding u)
   goals met: 3 of 6
8. (stack u s)
   deleted: (holding u) (clear s)
   added: (clear u) (handempty) (on u s)
   goals met: 4 of 6
9. (pick-up r)
   deleted: (ontable r) (clear r) (handempty)
   added: (holding r)
   goals met: 4 of 6
10. (stack r u)
   deleted: (holding r) (clear u)
   added: (clear r) (handempty) (on r u)
   goals met: 5 of 6
11. (pick-up c)
   deleted: (ontable c) (clear c) (handempty)
   added: (holding c)
   goals met: 4 of 6
12. (stack c r)
   deleted: (holding c) (clear r)
   added: (clear c) (handempty) (on c r)
   goals met: 6 of 6
